# Task 1.2 – Data Structures

## Pandas
Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals.

It is a popular Python package for data science, and with good reason: it offers powerful, expressive and flexible data structures that make data manipulation and analysis easy, among many other things. The DataFrame is one of these structures.

### `import` statement
To use any package in your code, you must first make it accessible. You have to import it. You can't use anything in Python before it is defined. Some things are built in, for example the basic types (like `int`, `float`, etc) can be used whenever you want. But most things you will want to do will need a little more than that.

In [1]:
import pandas as pd

### DataFrames

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

* Potentially columns are of different types
* Size – Mutable
* Labeled axes (rows and columns)
* Can Perform Arithmetic operations on rows and columns

You can think of it as an SQL table or a spreadsheet data representation.

![DataFrame](https://www.tutorialspoint.com/python_pandas/images/structure_table.jpg)

A basic DataFrame, which can be created is an Empty Dataframe.

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

Use the `shape` attribute of a DataFrame to get its dimensions.

In [3]:
df.shape

(0, 0)

The DataFrame can also be created using a single list or a list of lists.

In [4]:
data = [1, 2, 3]
df = pd.DataFrame(data)
print(df.shape)
df

(3, 1)

   0
0  1
1  2
2  3

Using the parameter `columns` the names of the columns can be defined

In [5]:
data = [['Alex', 10], ['Bob', 12], ['Clarke', 13]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

### Task 1.2-1:  DataFrames

Do the following:

1.  Create any DataFrame with 1 column and 4 rows
*  Create any DataFrame with 2 columns and 2 rows
*  Create any DataFrame with named columns `A` and `B` and 1 row

In [6]:
# Create any DataFrame with 1 column and 4 rows
pd.DataFrame([1, 2, 3, 4])

   0
0  1
1  2
2  3
3  4

In [7]:
# Create any DataFrame with 2 columns and 2 rows
pd.DataFrame([[1, 2], [3, 4]])

   0  1
0  1  2
1  3  4

In [8]:
# Create any DataFrame with named columns A and B and 1 row
pd.DataFrame([[1, 2]], columns=['A', 'B'])

   A  B
0  1  2

### Input from csv and excel files

For large amounts of data, it makes sense to read in files instead of entering the data individually as lists by hand.

In [9]:
# Reading a csv file with the read_csv function
df = pd.read_csv('./data/1_2_titanic.csv')

To read an excel file, ensure you have the <b>`xlrd`</b> package installed (`pandas` method `read_excel` needs it).

With `pandas` and `xlrd` one can read an excel file by simply:

```python
# Reading from an excel file with read_excel
df = pd.read_excel('/path/to/file.xlsx')
```

In [10]:
# What are the dimensions
print(df.shape)

(891, 12)

In [11]:
# What are the column names
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
# What do the first few rows look like
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
# Get a brief overview of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Renaming row and column names

Rename columns (with <b>`columns`</b> keyword) and rows (with <b>`index`</b> keyword) inplace:

In [14]:
df.rename(index = {0: 'a', 1: 'b', 2: 'c'}, 
          columns = {'Pclass': 'PassengerClass'}, inplace = True)
df.head()

,PassengerId,Survived,PassengerClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
a,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
b,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
c,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Reordering of things

Using the dataframe from above, we shall now reorder the <b>rows</b>:

In [15]:
df2 = pd.DataFrame(df, index = ['b', 'c', 'a'])
df2

,PassengerId,Survived,PassengerClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
b,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
c,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
a,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S

### Task 1.2-2:  Reordering

How would you modify the above cell to do the same reordering, but at the same time, remove one, say the one labeled `b`

In [16]:
df2 = pd.DataFrame(df, index = ['c', 'a'])
df2

,PassengerId,Survived,PassengerClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
c,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
a,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S

### Slicing

In [17]:
# Reading a csv file with toy data
df = pd.read_csv('./data/1_2_slicing.csv', index_col=0)
df

                 one       two     three      four
2018-05-10  0.579459 -0.268729  0.348744  0.026152
2018-05-11  1.302760 -0.528889 -0.030845 -0.370698
2018-05-12 -1.191592 -0.062437 -0.891749  0.263962
2018-05-13 -0.834463  2.432804  0.564165  1.561563
2018-05-14  0.569978 -0.160426  0.388540 -0.226963
2018-05-15  0.270280 -0.837819  2.307152 -0.190350

Slice out rows 2-4

In [18]:
# note: rows are indexed starting by 0; first indexed row is included whereas last is excluded 
df[1:4]

                 one       two     three      four
2018-05-11  1.302760 -0.528889 -0.030845 -0.370698
2018-05-12 -1.191592 -0.062437 -0.891749  0.263962
2018-05-13 -0.834463  2.432804  0.564165  1.561563

Slice using index range (aka labels)

In [19]:
df['2018-05-12':'2018-05-13']

                 one       two     three      four
2018-05-12 -1.191592 -0.062437 -0.891749  0.263962
2018-05-13 -0.834463  2.432804  0.564165  1.561563

Slice with names using `loc`

In [20]:
df.loc[:, ['two', 'four']] # notice lack of parentheses here!

                 two      four
2018-05-10 -0.268729  0.026152
2018-05-11 -0.528889 -0.370698
2018-05-12 -0.062437  0.263962
2018-05-13  2.432804  1.561563
2018-05-14 -0.160426 -0.226963
2018-05-15 -0.837819 -0.190350

Slice with index using `iloc`

In [21]:
df.iloc[3,] # is this a row or column?

one     -0.834463
two      2.432804
three    0.564165
four     1.561563
Name: 2018-05-13, dtype: float64

Slice out specific rows and/or columns with `iloc`

In [22]:
df.iloc[[0, 3], [1, 2]]

                 two     three
2018-05-10 -0.268729  0.348744
2018-05-13  2.432804  0.564165

### Task 1.2-3:  Slicing rows and columns by index

Using this dataframe, 
```python
df = pd.read_csv('./data/1_2_slicing_exercise.csv', index_col=0)
```
Do the following:

1.  Slice out the first row by index
*  Slice out the first column by index
*  Slice out the first and last row, first and last column, by index

In [23]:
df = pd.read_csv('./data/1_2_slicing_exercise.csv', index_col=0)

In [24]:
# Slice out the first row by index
df.iloc[0]

A    0.650051
B   -0.887813
C   -0.177867
D   -1.210401
Name: 1974-01-01, dtype: float64

In [25]:
# Slice out the first column by index
df.iloc[:, 0]

1974-01-01    0.650051
1974-01-02    0.513062
1974-01-03   -0.574311
1974-01-04   -1.104512
1974-01-05    0.115862
1974-01-06    0.289349
Name: A, dtype: float64

In [26]:
# Slice out the first and last row, first and last column, by index
df.iloc[[0,-1], [0,-1]]

                   A         D
1974-01-01  0.650051 -1.210401
1974-01-06  0.289349  0.598515

### Filter

Extracting individual rows based on conditions from a DataFrame.

In [27]:
# Reading a csv file with toy data
df = pd.read_csv('./data/1_2_filter.csv', index_col=0)
df

  country     name  salary
0      US    Alice   40000
1      DE      Bob   24000
2      IT  Charles   31000
3      US    David   20000
4      IT     Eric   30000

Define a certain condition:

In [28]:
df['salary'] > 30000

0     True
1    False
2     True
3    False
4    False
Name: salary, dtype: bool

The resulting list of boolean values can be used as filter for the DataFrame.

In [29]:
df[[True, False, True, False, False]]

  country     name  salary
0      US    Alice   40000
2      IT  Charles   31000

Combined the statement looks like this:

In [30]:
df[df['salary'] > 30000]

  country     name  salary
0      US    Alice   40000
2      IT  Charles   31000

### Task 1.2-4:  Filter rows by conditions

Using the above dataframe, do the following:

1.  Filter all employees from the US
*  Filter all US employees with a salary > 3000
* Filter all employees with a salary > 3000 which are NOT from the US

Note: Conditions can also be combined by the logical operators `&` (and), `|` (or), `~` (not).

In [31]:
# Filter all employees from the US
df[df['country'] == 'US']

  country   name  salary
0      US  Alice   40000
3      US  David   20000

In [32]:
# Filter all US employees with a salary > 3000
df[(df['salary'] > 30000) & (df['country'] == 'US')]

  country   name  salary
0      US  Alice   40000

In [33]:
# Filter all employees with a salary > 3000 which are NOT from the US
df[(df['salary'] > 30000) & ~(df['country'] == 'US')]

  country     name  salary
2      IT  Charles   31000

### Operations

A large number of methods for computing descriptive statistics and other related operations on DataFrames are available in pandas. Most of these are aggregations (hence producing a lower-dimensional result) like sum(), mean(), and quantile(), but some of them, like cumsum() and cumprod(), produce an object of the same size.

Generally speaking, these methods take an axis argument, but the axis can be specified by name or integer: 
“index” (axis=0, default), “columns” (axis=1)

In [34]:
# Let's import another toy dataframe
df = pd.read_csv('./data/1_2_operations.csv', index_col=0)
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

Calculate some basic descriptive statistics:

In [35]:
df.mean()  # try also axis = 0/1 or 'index'/'columns'

a    4.5
b    5.5
c    6.5
dtype: float64

In [36]:
df.sum()

a    18
b    22
c    26
dtype: int64

In [37]:
df.count()

a    4
b    4
c    4
dtype: int64

In [38]:
df.cumsum()

    a   b   c
0   0   1   2
1   3   5   7
2   9  12  15
3  18  22  26

There is a convenient `describe()` function which computes a variety of summary statistics about 
the columns of a DataFrame:

In [39]:
df.describe()

              a          b          c
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

### DataFrame Manipulation

#### Dropping labels from an axis

In [40]:
df.drop(['a', 'c'], axis='columns')

    b
0   1
1   4
2   7
3  10

In [41]:
df.drop([1, 2], axis='index')

   a   b   c
0  0   1   2
3  9  10  11

#### Creating new columns

In [42]:
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [43]:
df['d'] = 3
df

   a   b   c  d
0  0   1   2  3
1  3   4   5  3
2  6   7   8  3
3  9  10  11  3

### Task 1.2-5:  DataFrame Manipulation

Using the above dataframe, 
```python
df = pd.read_csv('./data/1_2_operations.csv', index_col=0)
```
Do the following:

1.  Append an additional column named `line sum` containing the line sum
*  Drop column `b` and refresh the line sum

In [44]:
df = pd.read_csv('./data/1_2_operations.csv', index_col=0)

In [45]:
# Append an additional column named `line sum` containing the line sum
df['line sum'] = df.sum(axis='columns')

In [46]:
# Drop column `b` and refresh the line sum
df = df.drop(['b'], axis='columns')
df['line sum'] = df.sum(axis='columns')
df

   a   c  line sum
0  0   2         5
1  3   5        20
2  6   8        35
3  9  11        50